Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_law/european_laws.html.txt.tmx
Source language: en
Languages: ga

source: The fundamental laws or rules of the European Union (EU) are set out in the Treaties
ga: Tá bundlíthe nó rialacha Aontas na hEorpa (AE) leagtha síos i gconarthaí

source: All treaties must be agreed and ratified by the member states
ga: Ní mór do gach ballstát gach conradh a aontú agus a dhaingniú

source: A treaty is ratified when it becomes part of the law of the member states
ga: Deartar go bhfuil conradh daingnithe nuair atá glactha leis mar chuid de dhlí na mballstát

source: The most important treaty is the Treaty of Rome, which created the European Economic Community in 1957
ga: Is é Conradh na Róimhe, a chruthaigh an Comhphobal Eacnamaíochta Eorpach i 1957 an conradh is tábhachtaí

source: Since the Treaty of Rome, there have been a number of treaties agreed and ratified by all the member states;
ga: Ó bhí Conradh na Róimhe ann bhí roinnt conarthaí eile aontaithe agus daingnithe ag na baillstáit uilig;

source: • The Merger Treaty in 1967, which merged the institutions of the three communities
ga: • Conradh an Chumaisc i 1967 a thug le chéile institiúidí an trí phobail

source: • The Single European Act in 1986, which provided for completion of the single market
ga: • An Ionstraim Eorpach Aonair i 1986, a chruthaigh an t-aonmhargadh

source: • The Treaty on European Union (the Maastricht Treaty) in 1992, which provided for political and economic union amongst the member states
ga: • Conradh ar an Aontas Eorpach (Conradh Maastricht) i 1992, a sholáthair aontas eacnamaíoch agus polaitiúil i measc na mballstát

source: • The Treaty of Amsterdam in 1997, which made some changes to the powers of the institutions of the EU and paved the way for EU enlargement
ga: • Conradh Amstardaim i 1997, a rinneadh roinnt athruithe ar chumhachtaí institiúidí an AE agus a chruthaigh an bealach leis an AE a mhéadú

source: • The Treaty of Nice 2001 which made further changes to the powers and structures of the institutions to facilitate enlargement
ga: • Conradh Nice sa bhliain 2001 a rinneadh tuilleadh athruithe ar chumhachtaí agus struchtúir na n-institiúidí le cur ar chumas an Aontais é féin a mhéadú

source: • The Treaty of Lisbon 2007 which came into effect on 1 December 2009 made changes to how decisions are made at EU level
ga: • Conradh Lisbon 2007 a tháinig i bhfeidhm an 1 Nollaig 2009 a rinneadh tuilleadh athruithe ar chinnteoireacht ar leibhéal AE

source: The Treaty of Lisbon amended the EU's two core treaties, the Treaty on European Union and the Treaty establishing the European Community
ga: Conradh Liospóin leasú dhá phríomhchonradh an AE, an Conradh ar an Aontas Eorpach agus an Chonartha ag bunú an Chomhphobail Eorpaigh

source: The latter was renamed the Treaty on the Functioning of the European Union
ga: Athainmníodh an dara ceann leis an gConradh ar Fheidhmiú an Aontais Eorpaigh

source: In addition, several Protocols and Declarations were attached to the Lisbon Treaty
ga: Ina theannta sin, cuireadh roinnt Prótacal agus Dearbhuithe atá i gceangal le Conradh Liospóin

source: The europa.eu website has more information on the Lisbon Treaty
ga: Tá tuilleadh eolais faoi Chonradh Liospóin ar an láithreán gréasáin europa.eu

source: Treaties are the primary source of EU law but there are also secondary sources of EU law; the institutions of the EU have the power to make legislation
ga: Is iad na conarthaí príomhfhoinse dlí an AE ach tá fo-fhoinsí eile ann freisin: tá cumhacht reachtaíochta ag institiúidí an AE

source: This power is shared between the European Commission, the Council of the European Union and the European Parliament
ga: Tá an chumhacht seo roinnte idir Coimisiún na hEorpa, agus Comhairle Aontas na hEorpa agus Parlaimint na hEorpa

source: Under the European citizens' initiative, one million EU citizens from at least 7 EU countries can call on the European Commission to propose legislation on matters where the EU has competence to legislate
ga: Faoin tionscnamh ó na saoránaigh Eorpacha, is féidir milliún saoránach AE ó ar a laghad 7 tíortha an AE iarraidh ar an gCoimisiún Eorpach reachtaíocht a mholadh maidir le ceisteanna a bhfuil gá inniúlacht ag reachtú

source: There are different types of secondary legislation:
ga: Tá cineálacha difriúla fo-reachtaíochta ann:

source: These are laws that apply to everyone including all member states
ga: Is dlíthe iad seo a bhaineann le gach duine, na Ballstáit ar fad san áireamh

source: Regulations become part of national law and are enforceable in national courts immediately once they come into force
ga: Glactar le Rialacháin mar chuid den dlí náisiúnta agus cuirtear i bhfeidhm iad sna cúirteanna náisiúnta láithreach

source: They do not need to be brought in by any national legislation
ga: Níl aon ghá le reachtaíocht náisiúnta len iad a thabhairt isteach sa dlí

source: A Directive is a form of order to member states to implement national legislation to achieve a specific result
ga: Ordú do na Ballstáit í Treoir le reachtaíocht náisiúnta a thabhairt isteach ar mhaithe le toradh faoi leith

source: It is up to the national governments to decide on the form and method of the legislation necessary to achieve that result
ga: Tá sé suas ag na rialtais náisiúnta cinneadh a dhéanamh cén cineál reachtaíochta a theastaíonn leis an toradh sin a bhaint amach

source: Usually, a Directive will specify a deadline for the implementation of legislation
ga: Is iondúil go mbeidh dáta leagtha síos i dTreoir leis an reachtaíocht chuí a bheith curtha i bhfeidhm

source: A decision is addressed to a limited and defined group of persons, e.g., one member state or a corporation
ga: Bíonn cinneadh dírithe ar ghrúpa teoranta nó grúpa faoi leith daoine, mar shampla Ballstát amháin nó corparáid

source: They are binding upon those to whom they are addressed
ga: Ní mór dóibh siúd lena mbaineann siad cloí leo

source: These are not binding - they are simply recommendations
ga: Ní gá cloí leo seo – níl iontu ach moltaí

source: EU legislation is published in the Official Journal of the Community and the date that it comes into effect is stated in the Journal
ga: Déantar reachtaíocht an AE a fhoilsiú in Iris Oifigiúil an Chomhphobail agus bíonn an dáta lena dtagann sé i bhfeidhm luaite freisin san Iris

source: The Official Journal is published every working day and consists of a number of sections including legislation, information and notices and public tenders
ga: Foilsítear an tIris Oifigiúil gach lá oibre agus tá roinnt rannóga ann ina measc reachtaíocht, eolas agus fógraí agus tairiscintí poiblí

source: You can search for EU legal texts on the EUR-Lex website
ga: Is féidir leat téacsanna dlíthiúla an AE a chuardach ar shuíomh idirlín EUR-Lex

source: One of the most important aspects of the European Union is that its legislation is superior to all national legislation
ga: Ceann de na gnéithe is tábhachtaí den Aontas Eorpach go bhfuil a reachtaíocht níos údarásaí ná aon reachtaíocht náisiúnta

source: This means that European law is supreme
ga: Mar sin tá cumhacht uachtarach ag Dlí na hEorpa

source: Nothing in our national laws can override or take precedence over an EU law
ga: Ní féidir le tada i mBunreacht na hÉireann ná in aon cheann denár dlíthe náisiúnta dlí na hEorpa a shárú nó tosaíocht a bheith aige ar dhlí na hEorpa
